{
    "version": "https://jsonfeed.org/version/1",
    "title": "David Eads",
    "description": "",
    "home_page_url": "https://thedavideads.github.io/gh-pages",
    "feed_url": "https://thedavideads.github.io/gh-pages/feed.json",
    "user_comment": "",
    "author": {
        "name": "David Eads"
    },
    "items": [
        {
            "id": "https://thedavideads.github.io/gh-pages/the-scriptures.html",
            "url": "https://thedavideads.github.io/gh-pages/the-scriptures.html",
            "title": "The Scriptures",
            "summary": "“The Bible is unnecessary and irrelevant to my life!” That’s a phrase you won’t hear from the lips of any professing Christian. But, unfortunately, many of us live as if this statement were true. Let’s look at the data from “Frequency of reading scripture among&hellip;",
            "content_html": "<p>“The Bible is unnecessary and irrelevant to my life!” <!-- notionvc: 8c916ce8-835a-433d-ae24-ef440f706bcf --></p>\n<p>That’s a phrase you won’t hear from the lips of any professing Christian. But, unfortunately, many of us live as if this statement were true.<!-- notionvc: 960274fb-5064-4068-b39c-df6f321a5a42 --></p>\n<p>Let’s look at the data from “Frequency of reading scripture among Christians” by Pew Research.</p>\n<p><!-- notionvc: 8e99fc4c-efb0-4a8f-93f8-f7eb20261548 --></p>\n<table class=\"table-title table-bordered\" style=\"border-collapse: collapse; width: 100%; border-color: .table-title; border-style: solid;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Frequency</td>\n<td style=\"width: 49.9288%;\">Percentage</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Once a week</td>\n<td style=\"width: 49.9288%;\">45%</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">1-2x per month</td>\n<td style=\"width: 49.9288%;\">12%</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Several times per year</td>\n<td style=\"width: 49.9288%;\">9%</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Never</td>\n<td style=\"width: 49.9288%;\">33%</td>\n</tr>\n</tbody>\n</table>\n<p>33% of Christians — Christians, not unbelievers — <em><span class=\"notion-enable-hover\" data-token-index=\"1\">never</span></em> read their bible. Never! And another 21% barely reference it. All told, almost 50% of professing Christians basically never open their bible.<!-- notionvc: 2d51e7f3-65b5-4d01-9f5f-f00014e875df --></p>\n<p>What is the result of this? Does it really matter if Christians don’t read their bible?<!-- notionvc: cfe691d0-b017-41c4-8ec5-ba8d15b0712e --></p>\n<p>Let’s see what God has to say about it.<!-- notionvc: 2ca9dff7-f71f-4dff-ab68-717ea66c3d2c --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">My people are </span><strong><span class=\"notion-enable-hover\" data-token-index=\"1\">destroyed</span><span class=\"notion-enable-hover\" data-token-index=\"2\"> </span><span class=\"notion-enable-hover\" data-token-index=\"3\">for lack of knowledge</span></strong></em><span class=\"notion-enable-hover\" data-token-index=\"4\"><em>; because you have rejected knowledge</em><br></span> Hosea 4:6<!-- notionvc: 50bca482-514c-43fe-a070-4905cb474e7d --></p>\n<p>Many Christians today have chosen to reject knowledge. By not opening our bible, we reject the knowledge of God and attempt life on our own terms, according to our own, earthly knowledge. And this rejecting of God’s knowledge — the rejecting of his word — leads to destruction.</p>\n<p>We see this destruction all around us — a church, a people in ruin. Sin runs rampant through congregations across the globe. Depression and anxiety have become “normal” in Christian circles. Pornography, affairs and other sexual sin destroy families, youth and even pastors. Pride flags hang proudly. Envy, gossip and arrogance are unchallenged. Truly God’s people are destroyed, just as Hosea prophesied.</p>\n<p><!-- notionvc: bb1c59ed-98f7-48db-a3ef-67e059e08664 --></p>\n<p>If this seems like a desperate situation — and it is! — still there remains hope. Sin does not have the final word, God does. And his word stands true. And his word has been given to us. We must just open the book and seek after God and the knowledge he provides.</p>\n<p>If you’re one of those 50% — one who never or infrequently reads the bible — then this is for you. Maybe you’re experiencing the effects of this destruction and are looking for a light in the midst of darkness. Well, let me promise you friend, God’s word is a light and can deliver you from darkness!</p>\n<p><!-- notionvc: d14ed1dd-6252-4508-844c-107b4021ecdd --></p>\n<p class=\"msg--highlight msg \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">Your word is a lamp to my feet and a light to my path.</span></em> <br>Psalm 119:105<!-- notionvc: 191dc783-a9db-4062-9d9b-40e5004ec8a4 --></p>\n<p>Let’s explore together the necessity, blessing and importance of the scriptures — God’s holy word — in your life!<!-- notionvc: 3a2c7357-6c3e-4d2a-8f29-a08d4dfae1cf --></p>\n<hr>\n<h2>Jesus, Revealed</h2>\n<p>First and foremost, let’s look at the purpose of scripture. God gave us his word with one purpose in mind:</p>\n<p><strong>To reveal his son.</strong></p>\n<p>In some Christian circles today, you hardly ever hear the name Jesus or talk of the Christ, God’s anointed. But what is the “Christian” without “Christ”? Jesus Christ is central to our faith — and central to the word God delivered to us.</p>\n<p><!-- notionvc: 8725f856-439d-44eb-b05b-53e026842d17 --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">You search the Scriptures because you think that in them you have eternal life; </span><span class=\"notion-enable-hover\" data-token-index=\"1\">and it is they that bear witness about me</span></em><span class=\"notion-enable-hover\" data-token-index=\"2\"><em>, yet you refuse to come to me that you may have life.</em><br></span>John 5:39-40<!-- notionvc: df898648-3486-4b90-bc19-05acdea44134 --></p>\n<p>God’s stated purpose of scripture is to bear witness to — to reveal — Jesus. There is no other goal, no other motive.</p>\n<p>God’s great intention for your life is to conform you into the image of his son (see Romans 8:29). And he’s given his word — the revealing of his son — as a path to get to know Jesus and become more like him.</p>\n<p><!-- notionvc: 115533e6-6376-40bb-8ec1-18bc9f701473 --></p>\n<h2>True Life</h2>\n<p>The life of the Christian is found in the person of Jesus. Jesus is the way, the truth and <span class=\"notion-enable-hover\" data-token-index=\"1\">the life</span> (see John 14:6). There is no life outside of him. There may be physical existence, but no true life is found outside of the son of God. Look at Paul’s statement to the Galatians:<!-- notionvc: 57e0cc6f-c769-4451-a2cf-28a02624e2c2 --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">I have been crucified with Christ. </span><strong><span class=\"notion-enable-hover\" data-token-index=\"1\">It is no longer I who live, but Christ who lives in me</span></strong><span class=\"notion-enable-hover\" data-token-index=\"2\">. And the life I now live in the flesh I live by faith in the Son of God, who loved me and gave himself for me.</span></em> <br>Galatians 2:20<!-- notionvc: 4164a890-b3d5-485f-a108-8fe1c842be10 --></p>\n<p>The life Paul lived on earth was no longer his, but Christ’s. Christ was living <em>through</em> Paul. And God wants the same for all Christians.</p>\n<p>But in order for Christ to live through us, we must first get to know him. God is looking for a life-giving relationship — not a mere one hour transaction on Sunday. In fact, those who merely profess the name of Jesus but fail to cultivate a relationship with him are at risk of eternal damnation. See Jesus’ words in Matthew:</p>\n<p class=\"msg msg--highlight \"><!-- notionvc: b7aaa641-8528-4f6e-a5be-7c980cc82dab --><em><span class=\"notion-enable-hover\" data-token-index=\"0\">Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven. On that day many will say to me, ‘Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do many mighty works in your name?’ And then will I declare to them, ‘I never knew you; depart from me, you workers of lawlessness.’</span></em> <br>Matthew 7:21-23<!-- notionvc: 0e4fd240-95f2-45c7-93e4-bfff9d226bc6 --></p>\n<p>A mere profession of faith in God, devoid of an actual relationship — calling him Lord, but not treating him as Lord — equates to “lawlessness” to God. This word can also be translated as “iniquity,” “disobedience,” or “sin” and bears the meaning of “a willful disregard for God's commandments and a lifestyle characterized by sin and rebellion against divine order.”</p>\n<p>Calling him God, but not cultivating a relationship with him — knowing him and being known by him — equates as sin to God and, if not corrected, in the end will cause him to say, “depart from me, I never knew you.”</p>\n<p>God takes the knowledge and revelation of his son very seriously! He gave his son to redeem us from a life of sin — to redeem us from ourselves — and to restore us back to a life-giving relationship.</p>\n<p>This is why Jesus is central to the bible — Jesus is central to God’s plan to restore humanity. With Jesus, God paid the ultimate price for our salvation and rejecting his son is no small matter.</p>\n<p>But, thanks be to God, he has given us his word! His word reveals his son and invites us into a relationship with him.</p>\n<p>Now let’s discover how we form this life-giving relationship with Jesus through God’s word.</p>\n<p><!-- notionvc: 5e9a3c68-9ab3-493c-96e0-a61965421c98 --></p>\n<h2>Daily Bread</h2>\n<p>In his famous prayer, <em><span class=\"notion-enable-hover\" data-token-index=\"1\">The Lord’s Prayer</span></em>, Jesus uses this phrase: “Give us this day our daily bread.” This seemingly simple phrase holds within it a profound truth. To better understand the meaning, let’s look at another time Jesus uses “bread” in his teaching.<!-- notionvc: b59d58a0-212e-4473-a7b9-8a76f5b13182 --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">Jesus said to them, “I am the bread of life; whoever comes to me shall not hunger, and whoever believes in me shall never thirst.</span></em> <br>John 6:35<!-- notionvc: 28bdcb2a-b1df-4a7e-b3ea-dabb0c0c8d5d --></p>\n<p>Jesus likens <em>himself</em> to bread — not simple, natural bread — but bread that nourishes to eternal life! This is the type of “daily bread” Jesus refers to in his prayer.</p>\n<p>Just as we need “daily bread” to sustain our physical bodies, we need “daily bread” to sustain, grow and thrive in our spiritual life. Our spirit needs Jesus to live. Without Jesus, our spirit becomes malnourished and incapable of proper function.</p>\n<p>What would happen if you never fed your physical body? It would be severely malnourished, deteriorate and eventually cease functioning. It’s the <em>exact</em> same in our spiritual life! Our spirit <em>needs</em> Jesus to live and <em>needs</em> Jesus to thrive. Without him we are nothing!</p>\n<p>Let’s continue in John 6.</p>\n<p><!-- notionvc: 9e3fb68e-12b5-4f62-a3e9-d0d9e850869d --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">This is the bread that came down from heaven, not like the bread the fathers ate, and died. Whoever feeds on this bread will live forever.</span></em> <br>John 6:58<!-- notionvc: 6598c712-9483-4686-95dd-bcd9ac65c8f6 --></p>\n<p>We must feed on Jesus as the bread of life. This is the secret to understanding Jesus’ words in John 5. Let’s revisit.<!-- notionvc: b11b0b57-d90b-4179-a229-b7ea8a98717f --></p>\n<p class=\"msg msg--highlight \"><span class=\"notion-enable-hover\" data-token-index=\"0\"><em>You search the Scriptures because you think that in them you have eternal life; and it is they that bear witness about me, yet you refuse to come to me that you may have life.</em><br></span>John 5:39-40<!-- notionvc: fcbff207-f1cb-40cf-9115-e568a5667442 --></p>\n<p>Jesus presents two types of people in these verses:</p>\n<ol>\n<li>Those who read the bible, completely miss Jesus and continue in death</li>\n<li>Those who read the bible, feast on Jesus and thrive in life</li>\n</ol>\n<p><!-- notionvc: e1fc827e-2bff-4c4d-80e3-6d39eb62d6ff --></p>\n<p><strong>Said another way: there are those who simply read the bible and there are those who form a relationship with Jesus.</strong> <!-- notionvc: 175652cc-666d-4029-9211-9fcd131d0823 --></p>\n<p>Here in John 5, Jesus is rebuking the Pharisees, the religious elite of the day. The Pharisees spent their whole lives in supposed devotion and obedience to God — except they missed the entire point! The Pharisees sought after God with the wrong heart and for the wrong reasons. All the time and energy they spent was an utter waste in the eyes of Christ. May it not be said of us!</p>\n<p>Religious activity may make us feel good or make us look good — but God looks after the heart. Jesus knew the Pharisees heart and that they looked to their own devotion and good works as a means to eternal life. But Jesus lives — and rules — by an entirely different paradigm. Jesus is not looking for religious activity, but a living relationship with his creation.</p>\n<p>This is the essence of John 5:39-40. Jesus knows the scriptures are about him, but to discover him — and eternal life — we have to come with the right heart. We have to come with a desire to know him and develop and grow in a relationship with him. We have to come with a desire to feed on the bread of life.</p>\n<p><!-- notionvc: e1521fb9-8243-4873-b08c-db9c02c1bde1 --></p>\n<p>During his earthly ministry Jesus called his disciples to “follow me.” This is an invitation to relationship. And Jesus still extends this same relationship to you and I.</p>\n<p>Even further, the end of the age culminates with a marriage between Jesus and his people. That is why we are called the “bride of Christ.” But what husband marries a woman he doesn’t know? It’s the same with God. To achieve eternal life — eternal bridal union — we must <em>know</em> our maker and develop a mutual relationship with him.</p>\n<p>This is why Jesus uses the phrase <em>daily</em> bread. Jesus wants a daily relationship with us. He wants to get to know us and reveal more of himself to us as we walk with him day after day.</p>\n<p>Getting to know Jesus is no different than getting to know a close friend or a spouse. It requires intentional time and devotion. It requires a desire to know them and to open yourself to them. That is the path towards forming a deep relationship — and the path God wants to take with us!</p>\n<p><!-- notionvc: 8f2d85c3-0590-4c4e-831c-0b8b451c825a --></p>\n<h2>Well Fed</h2>\n<p>Let’s close by contrasting two scriptures we already discussed. <!-- notionvc: 0b3b8bae-1ea4-45b4-9e97-c678f10d4d8f --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">My people are destroyed for lack of knowledge; because you have rejected knowledge<br></span></em>Hosea 4:6<!-- notionvc: 06b2f3fb-af44-4211-8815-6014aac17d74 --></p>\n<p>Here God describes the malnourished life. The life that leads to death. These are the people who never or refused to eat from the true bread of life. The people who had no desire to truly know God and no desire to open themselves to his light.</p>\n<p>True, life-giving relationship is difficult. It requires sacrifice, humility and a repentant heart. But many refuse this way of life — both in the natural and in the spirit. Pride is easier than humility. Independence easier than dependence. John describes it in this way: “The light has come into the world, and the people loved the darkness rather than the light because their works were evil” (John 3:19).</p>\n<p><!-- notionvc: d937e125-01bc-40a9-85bb-b36c73589852 --></p>\n<hr>\n<p>On the other had we have the well fed life. <!-- notionvc: 6103477b-2bba-4d0b-acee-5bb765cb459c --></p>\n<p class=\"msg msg--highlight \"><em><span class=\"notion-enable-hover\" data-token-index=\"0\">This is the bread that came down from heaven, not like the bread the fathers ate, and died. Whoever feeds on this bread will live forever.</span></em> <br>John 6:58<!-- notionvc: 8fe684fa-4ed4-46cc-889f-9afb179f5497 --></p>\n<p>These are those who have chosen a true relationship with Jesus. The people who have opened their hearts to his light, his correction and his direction. Those who have chosen dependence over independence and humility over pride.</p>\n<p>These are those who feast on the son of God and inherit eternal life. This is the well fed life.</p>\n<p>In no way are the “well fed” perfect, but they are humble and desire to know God and to obey his commands.</p>\n<p>May we all lead the well fed life. May we find life, light and joy in the person of Jesus. May we experience — and respond — to his love and develop the life-giving relationship with him he so desires.</p>\n<p><!-- notionvc: fd3c4421-ecea-404c-9f1a-9a0e55ecf82e --></p>",
            "author": {
                "name": "David Eads"
            },
            "tags": [
            ],
            "date_published": "2025-02-03T10:52:02-05:00",
            "date_modified": "2025-02-03T10:52:02-05:00"
        },
        {
            "id": "https://thedavideads.github.io/gh-pages/obedience.html",
            "url": "https://thedavideads.github.io/gh-pages/obedience.html",
            "title": "Obedience",
            "summary": "What is one universal skill that all children learn? Obedience. Obey your parents. Obey your elders. Obey your teachers. Obey the law. Obey! And what is the most difficult skill for all children to learn? Obedience! As children, we’re built-in with our own will, but&hellip;",
            "content_html": "\n  <p>\n    What is one universal skill that all children learn? Obedience. Obey your parents. Obey your elders. Obey your teachers. Obey the law. Obey! And what is the most difficult skill for all children to learn? Obedience!\n  </p>\n\n  <p>\n    As children, we’re built-in with our own will, but with no capacity to throttle our desires. We have to learn — over many years — the skill of obedience. Our parents bear the weight of teaching us — again, over many years! — the necessity of obedience.\n  </p>\n\n  <p>\n    God, as our Heavenly Father, bears the same responsibility and desires the same outcome for us — a life of obedience. Obedience is central to both our natural and our spiritual life.\n  </p>\n<hr class=\"separator separator--long-line\" />\n\n    <h2 id=\"the-call-to-obedience\">\n      The call to obedience\n    </h2>\n\n  <p>\n    In the Old Covenant, God gave Moses divine instruction for the people of Israel from the top of a mountain (see Exodus 19 &amp; 20). And again in the New Covenant, God gives us divine instruction from the top of a mountain, this time through Jesus in his famous Sermon on the Mount (see Matthew 5-7).\n  </p>\n\n  <p>\n    Jesus teaches us many things in this sermon — how to think, how to act and how to handle certain situations — a “101” of sorts on the Christian life. But, to learn of obedience, let’s look at the capstone of this famous sermon:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Everyone then <b>who hears these words of mine and does them will be like a wise man</b> who built his house on the rock. And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock. And <b>everyone who hears these words of mine and does not do them will be like a foolish man</b> who built his house on the sand. And the rain fell, and the floods came, and the winds blew and beat against that house, and it fell, and great was the fall of it.</i><br>Matthew 7:24-26\n  </p>\n\n  <p>\n    Jesus closes with an emphasis on obedience. His final point, the one he wants to leave his hearers with, is a call to obedience.\n  </p>\n\n  <p>\n    Jesus knows there will be many who hear his words, both then and now. He was thronged by people all during his earthly ministry, with thousands hearing his teachings. And today, millions more fill the pews each Sunday to hear the words of God.\n  </p>\n\n  <p>\n    However, Jesus knows there are many who will hear, but he is concerned with those who will hear and <i>do</i>. This is the distinction he makes in Matthew 7. Those who simply hear, but fail to obey, are called “foolish,” while those who hear and obey are called “wise.” What title do you want from God?\n  </p>\n\n  <p>\n    As we learned growing up, obedience requires action — hearing and doing. <i>Go</i> clean your room. <i>Do</i> your homework. <i>Take</i> out the trash. The same call to action is present in our life with God. <i>Follow</i> me. <i>Go</i> make disciples. <i>Pray</i> to the Lord of the harvest. In order to obey, we must act on the commandment.&nbsp;\n  </p>\n\n  <p>\n    Jesus knows there are many who hear, but fewer who do. He knows that “faith without works is dead.” God is not looking for hearers, he is looking for doers.\n  </p>\n<hr class=\"separator separator--long-line\" />\n\n    <h2 id=\"disobedience-leads-to-death\">\n      Disobedience leads to death\n    </h2>\n\n  <p>\n    Obedience is no small matter to God. To emphasize the point, let’s explore the other side of the coin: disobedience. Is it really that bad if we disobey God? Hebrews 4:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For we who have believed enter that rest, as he has said, <br><br>“As I swore in my wrath, <br>‘They shall not enter my rest,’” <br><br>although his works were finished from the foundation of the world. For he has somewhere spoken of the seventh day in this way: “And God rested on the seventh day from all his works.” And again in this passage he said, <br><br>“They shall not enter my rest.” <br><br>Since therefore it remains for some to enter it, <b>and those who formerly received the good news failed to enter because of disobedience</b>, again he appoints a certain day, “Today,” saying through David so long afterward, in the words already quoted, <br><br>“Today, if you hear his voice, do not harden your hearts.” <br><br>For if Joshua had given them rest, God would not have spoken of another day later on. So then, there remains a Sabbath rest for the people of God, for whoever has entered God’s rest has also rested from his works as God did from his. <b>Let us therefore strive to enter that rest, so that no one may fall by the same sort of disobedience</b>.</i><br>Hebrews 4:3-11\n  </p>\n\n  <p>\n    The author of Hebrews is hearkening back to Israel’s exodus from Egypt to teach us a lesson about disobedience. And remember, the Old Testament scriptures are there to teach and grow New Testament Christians (see 2 Timothy 3:16-17).\n  </p>\n\n  <p>\n    As a quick summary of the exodus, Israel was enslaved and exhausted in Egypt. God sent Moses to rescue Israel and bring them into the land originally promised to Abraham.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Say therefore to the people of Israel, ‘I am the LORD, and I will bring you out from under the burdens of the Egyptians, and I will deliver you from slavery to them, and I will redeem you with an outstretched arm and with great acts of judgment. I will take you to be my people, and I will be your God, and you shall know that I am the LORD your God, who has brought you our from under the burdens of the Egyptians. I will bring you into the land that I swore to give to Abraham, to Isaac, and to Jacob. I will give it to you as a possession. I am the LORD.’</i><br>Exodus 6:6-8&nbsp;\n  </p>\n\n  <p>\n    Through this process, Israel faced challenges and began to doubt God’s ability and question his motive.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>“Yet you would not go up, but rebelled against the command of the&nbsp;Lord&nbsp;your God.&nbsp;And&nbsp;you murmured in your tents and said, ‘Because the&nbsp;Lord&nbsp;hated us he has brought us out of the land of Egypt,&nbsp;to give us into the hand of the Amorites, to destroy us.<br>“And the&nbsp;Lord&nbsp;heard your words and was angered, and he swore,&nbsp;‘Not one of these men of this evil generation shall see the good land that I swore to give to your fathers,&nbsp;except Caleb the son of Jephunneh. He shall see it, and to him and to his children I will give the land on which he has trodden, because he has wholly followed the&nbsp;Lord!’</i><br>Deuteronomy 1:26-27, 34-36&nbsp;\n  </p>\n\n  <p>\n    In Exodus 6, we see God declared his intentions for Israel. God had spoken a decree, now it was up to Israel to trust God to make it happen. How were they to show their trust in God? <i>Through obedience to his voice</i>.&nbsp;\n  </p>\n\n  <p>\n    In Deuteronomy 1, we see Israel’s disobedience kick in: “Yet you would not go up.” Israel refused to obey God and enter the Promised Land despite God’s decree to bring them there. Yes, Israel faced some seemingly insurmountable challenges, but God was looking for obedience to his voice.\n  </p>\n\n  <p>\n    The result of this? God barred the Israelites from entering the Promised Land. This is alluded to in Hebrews as being unable to enter God’s rest. And what does Hebrews warn us of?\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>and those who formerly received the good news failed to enter because of disobedience<br><br>Let us therefore strive to enter that rest, so that no one may fall by the same sort of disobedience.</i><br>Hebrews 4:6, 11&nbsp;\n  </p>\n\n  <p>\n    God is warning us — New Covenant believers — that a life of disobedience can lead to eternal separation from God (not entering his rest). God is not interested in lip service, he is looking for those who will hear <i>and do</i>.&nbsp;\n  </p>\n\n  <p>\n    Jesus:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Why do you call me ‘Lord, Lord,’ and not do what I tell you?</i><br>Luke 6:46\n  </p>\n\n  <p>\n    Let’s look at one more parable to drive the point home.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Then the kingdom of heaven will be like&nbsp;ten virgins who took their lamps&nbsp;and went to meet&nbsp;the bridegroom.&nbsp;<b>Five of them were foolish, and five were&nbsp;wise</b>.&nbsp;For when <b>the foolish took their lamps, they took no oil with them</b>,&nbsp;but the wise took flasks of oil with their lamps.&nbsp;As the bridegroom&nbsp;was delayed, they all became drowsy and slept.&nbsp;But&nbsp;at midnight there was a cry, ‘Here is the bridegroom! Come out to meet him.’&nbsp;Then all those virgins rose and&nbsp;trimmed their lamps.&nbsp;And <b>the foolish said to the wise, ‘Give us some of your oil, for our lamps are going out.’</b>&nbsp;But the wise answered, saying, ‘Since there will not be enough for us and for you, go rather to the dealers and buy for yourselves.’&nbsp;And while they were going to buy, the bridegroom came, and&nbsp;those who were ready went in with him to&nbsp;the marriage feast, and&nbsp;the door was shut.&nbsp;<b>Afterward the other virgins [the foolish virgins] came also, saying,&nbsp;‘Lord, lord, open to us.’</b>&nbsp;<b>But he answered, ‘Truly, I say to you,&nbsp;I do not know you.’</b>&nbsp;Watch therefore, for you&nbsp;know neither the day nor the hour.</i><br>Matthew 25:1-13&nbsp;\n  </p>\n\n  <p>\n    Remember back to Matthew 7, Jesus used the same, “wise” and “foolish” terminology as we see here. And what happened to the foolish virgins, the ones who merely heard, but did not do? The door to God’s eternal rest was closed to them. The foolish virgins appealed to the Lord, but the door remained closed, God even denying to know them!\n  </p>\n\n  <p>\n    If we wish to spend eternity with God, then we must learn to obey.\n  </p>\n\n    <h2 id=\"a-life-of-obedience\">\n      A life of obedience\n    </h2>\n\n  <p>\n    In Christian circles, it is easy to “talk to talk.” It is easy to fool people — even ourselves! — into believing we’re better than we really are. But God cannot be fooled. He has not called us to “talk the talk,” but rather to “walk the walk.”\n  </p>\n\n  <p>\n    Jesus called his disciples — and calls us today — to “follow me.” That is to walk with him, to follow in his footsteps, to learn from him, and ultimately to be like him.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For those whom he&nbsp;foreknew he also&nbsp;predestined&nbsp;<b>to be conformed to the image of his Son</b>, in order that he might be&nbsp;the firstborn among many brothers.</i><br>Romans 8:29&nbsp;\n  </p>\n\n  <p>\n    During his time on earth, Jesus lived in complete obedience — both to his earthly parents, as well as his heavenly Father. Jesus only did what the Father commanded him to do and only said what the Father commanded him to say. He both heard the Father’s words and obeyed his commands.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For I have not spoken on my own authority, but the Father who sent me has himself given me a commandment—what to say and what to speak.</i><br>John 12:49<br><br><i>So Jesus said to them, “Truly, truly, I say to you, the Son can do nothing of his own accord, but only what he sees the Father doing. For whatever the Father does, that the Son does likewise.</i><br>John 5:19<br><br><i>For I have come down from heaven, not to do my own will but the will of him who sent me.</i><br>John 6:38<br>\n  </p>\n\n  <p>\n    God is looking for the same sort of obedience from us. A total commitment to hear and do. Are your content to merely “talk the talk” and potentially miss out on eternity with Christ? Or would you rather “walk the walk” and learn to live a life of obedience?\n  </p>\n<hr class=\"separator separator--long-line\" />\n\n    <h2 id=\"practical-steps-towards-obedience\">\n      Practical steps towards obedience\n    </h2>\n\n  <p>\n    In order to live this life of obedience, we need learn three practical skills: how to listen, how God speaks, and how to obey. Let’s dive in!\n  </p>\n\n    <h3 id=\"step-1-how-to-listen\">\n      Step 1: How to Listen\n    </h3>\n\n  <p>\n    The first skill we need to learn is how to listen or, said another way, how to hear God’s voice. Good news, if you’ve surrendered your life to Christ, you already have this skill!\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>My sheep hear my voice, and I know them, and they follow me.</i><br>John 10:27&nbsp;\n  </p>\n\n  <p>\n    If you are one of God’s sheep, then, according to Jesus, you can hear his voice. Hallelujah! But although we all have the capacity to hear, we still need to understand how to listen for God and how to hear him clearly.\n  </p>\n\n  <p>\n    God <i>can</i> shout at you, but he typically whispers. How do you hear a whisper? You have to be still, quiet and attentive. But life is often busy, noisy and full, so we are unable to hear God’s whisper. We have to carve out time away from the noise and position ourselves to hear God’s whisper. We have to get alone with God, away from the distractions of life. This is the first step towards hearing from God.&nbsp;\n  </p>\n\n  <p>\n    Here’s a closing thought from Jesus on this point.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>And when you pray, you must not be like the hypocrites. For they love&nbsp;to stand and pray in the synagogues and at the street corners, that they may be seen by others.&nbsp;Truly, I say to you, they have received their reward. <b>But when you pray,&nbsp;go into your room and shut the door and pray to your Father who is in secret</b>.&nbsp;And your Father who sees in secret will reward you.</i><br>Matthew 6:5-6&nbsp;\n  </p>\n\n    <h3 id=\"step-2-how-god-speaks\">\n      Step 2: How God speaks\n    </h3>\n\n  <p>\n    Now that we know how to listen, we need to understand how God speaks. This is the second important skill.\n  </p>\n\n  <p>\n    God can speak in may ways, but two are most prominent — through his word and by his spirit.\n  </p>\n\n    <h4 id=\"the-scripturesandnbsp\">\n      The Scriptures&nbsp;\n    </h4>\n\n  <p>\n    God has given us his word and his word speaks of him.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>You search the Scriptures because you think that in them you have eternal life; it is these that testify about Me.</i><br>John 5:39&nbsp;\n  </p>\n\n  <p>\n    The bible is God’s autobiography to mankind. The scriptures speak of God, his ways, his desires, his heart and his dealings with man. The scriptures speak of God himself.\n  </p>\n\n  <p>\n    The scriptures are not some dead manuscript written by men of old. Nor are they a simple reference guide to life. The scriptures are alive and active and reveal the person of the living God. They speak of him.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For <b>the word of God is living and active</b> and sharper than any two-edged sword, and piercing as far as the division of soul and spirit, of both joints and marrow, and able to judge the thoughts and intentions of the heart.</i><br>Hebrews 4:12\n  </p>\n\n  <p>\n    If we want to hear from God, we must consult the book that contains his speaking, his voice. We must be people of the scriptures!\n  </p>\n\n    <h4 id=\"the-spirit\">\n      The Spirit\n    </h4>\n\n  <p>\n    While the scriptures are vitally important, we must not lean on our own understanding, but allow God to speak and reveal himself through his word <i>and by his spirit</i>.&nbsp;\n  </p>\n\n  <p>\n    Let’s look at two scriptures in turn to develop this point.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For the letter kills, but the Spirit gives life.</i><br>2 Corinthians 3:6\n  </p>\n\n  <p>\n    Paul is speaking about the scriptures and the spirit. And he makes a bold statement! The scriptures (the letter) alone kills or brings death. How can he make such a claim? Can the words of God bring death? Let’s look at our second verse.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>You search the Scriptures because you think that in them you have eternal life; and&nbsp;it is they that bear witness about me,&nbsp;yet&nbsp;you refuse to come to me that you may have life.</i><br>John 5:39-40\n  </p>\n\n  <p>\n    Here we have Jesus saying a very similar thing as Paul. Jesus is speaking to the Pharisees, who were people of the scriptures. They spend much time and energy learning the scriptures and seeking to live what they thought were holy, God-fearing lives. But, according to Jesus, they had it all wrong! All those years of study, all of that “holiness” wasted — bringing death — because they did not consult the scriptures in the right way or with the right heart!\n  </p>\n\n  <p>\n    Jesus tells them they think all their activity, all their “understanding,” all of their time studying scripture has been a waste. It has not lead them to the source of life, Jesus, so therefore they are on the path of death. Wow!\n  </p>\n\n  <p>\n    So not only must we be people of the scriptures, we also need to be people of his spirit. The scriptures by themselves can do nothing for us. It is God’s spirit speaking through the scriptures that brings life. Why? Because the spirit speaks of Jesus.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>But when the Helper comes, whom I will send to you from the Father, the Spirit of truth, who proceeds from the Father, he will bear witness about me.</i><br>John 15:26&nbsp;\n  </p>\n\n  <p>\n    The bible is not an end unto itself. The bible is a means of God speaking of and revealing his son, Jesus Christ of Nazareth. Jesus is life, so to receive life we must come to him. May we not be like the Pharisees and seek our own holiness, our own righteousness. But may we be the people of God who seek him and hear from his spirit and come close to his son.\n  </p>\n\n    <h3 id=\"step-3-how-to-obeyandnbsp\">\n      Step 3: How to obey&nbsp;\n    </h3>\n\n  <p>\n    We discovered how to listen for God and how to hear him speak. The last step is to obey!\n  </p>\n\n  <p>\n    If you put Steps 1 &amp; 2 into practice, you will start hearing from God. He will reveal himself to you and his will for your life. He will ask you to do things and stop doing other things. He is a master at knowing what you need and how to move you toward his ultimate goal, conformity to the image of his son (remember Romans 8:29).\n  </p>\n\n  <p>\n    Now, when God asks you to do something, all that is left is to do it! Some of what he asks will be easy. Some of what he asks will be hard. And still more may seem impossible. God is looking for obedience through it all. Remember the Israelites. They faced an impossible situation, and chose not to obey God’s voice. And what was their outcome?\n  </p>\n\n  <p>\n    A life of obedience to God will cost us, as it did Jesus, Paul and many people of the early and today’s persecuted Church. However, obedience does not mean perfection. While we may strive to obey God 100%, we will certainly fall short of that goal at times. And that’s okay!\n  </p>\n\n  <p>\n    Remember, we are God’s children and he is our Father. He is raising us as a father and treats us as such. Let’s look at an earthly example for a minute. Let’s assume a parent asks a nine year old to clean his room. The nine year old obeys immediately with no complaint (hallelujah!), however, he does a <i>horrible</i> job! Was he obedient? Yes! Did it match exactly what the parent wants? No! But the obedience was there. Now there is a teaching moment to help the child grow in his abilities and execution of the task. It may take time, but eventually that nine year old will be a fully functioning adult with the ability to clean his room.&nbsp;\n  </p>\n\n  <p>\n    God treats us the same. We may not execute his orders very well, but if the heart to obey is there that is what truly matters to him. That is a person he can work with. That is a person with the right heart that will allow God to mold and shape them over time. That is a life of obedience!\n  </p>\n\n    <h2 id=\"closing\">\n      Closing\n    </h2>\n\n  <p>\n    A life of obedience can be difficult, but it is full of reward.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For whoever would save his life will lose it, but whoever loses his life for my sake will find it.</i><br>Matthew 16:25&nbsp;\n  </p>\n\n  <p>\n    If we want God’s life, we have to lay down our own life — our will and our desires. But the return is far greater — life from God, the author and sustainer of life!\n  </p>\n\n  <p>\n    There is no true life or joy outside of God. There may be moments we experience in the flesh, but it all pales in comparison to the life God gives.\n  </p>\n\n  <p>\n    And not only does a life of obedience lead to God’s life, it leads to a special place in God’s heart.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Now therefore, if you will indeed obey my voice and keep my covenant, you shall be my treasured possession among all peoples.</i><br>Exodus 19:5\n  </p>\n\n  <p>\n    The path of obedience is the clear choice, but still, many choose their own path, their own way.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Enter by the narrow gate. For the gate is wide and the way is easy that leads to destruction, and those who enter by it are many. For the gate is narrow and the way is hard that leads to life, and those who find it are few.</i><br>Matthew 7:13-14&nbsp;\n  </p>\n\n  <p>\n    May we be people who listen and hear God’s voice. May we be people who choose God’s way. May we be a people who obey and be his treasured possession among all peoples.\n  </p>",
            "author": {
                "name": "David Eads"
            },
            "tags": [
            ],
            "date_published": "2025-01-27T14:45:59-05:00",
            "date_modified": "2025-01-27T14:45:59-05:00"
        },
        {
            "id": "https://thedavideads.github.io/gh-pages/in-rememberance.html",
            "url": "https://thedavideads.github.io/gh-pages/in-rememberance.html",
            "title": "In Rememberance",
            "summary": "It is common in our society to memorialize our accomplishments. In sports it’s a trophy or a ring. In business it’s a sportscar or a rolex. Maybe for parents it’s pictures or a fridge full of drawings. We like to celebrate - and remember -&hellip;",
            "content_html": "\n  <p>\n    It is common in our society to memorialize our accomplishments. In sports it’s a trophy or a ring. In business it’s a sportscar or a rolex. Maybe for parents it’s pictures or a fridge full of drawings. We like to celebrate - and remember - our achievements.\n  </p>\n\n  <p>\n    This is a trait passed down from our creator. God also enjoys celebrating and remembering his achievements. God instructed the Israelites to build a memorial when he brought them into the land of promise. And these stones shall be a memorial to the children of Israel forever (Joshua 4:7).\n  </p>\n\n  <p>\n    This was certainly a mighty work of God — delivering Israel from Egypt into the promised land — and one worthy to be remembered. But there is one Crown Jewel in God’s trophy case: the wounds of his son, Jesus.\n  </p>\n\n  <p>\n    God is most proud of his son and his accomplishments (2 Peter 1:17) and desires to showcase those to the world. Why was Jesus resurrected with his wounds? Could he not have been raised with an unmarred body? Or how about when he was received up to glory? Surely then his wounds could’ve been removed. But no:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>In the midst of the throne…stood a Lamb as though it had been slain</i><br>Revelation 5:6\n  </p>\n\n  <p>\n    Continuing further, what sacraments did God command to those who believe? Baptism and holy communion. Why were these given? At their core, to remember the sufferings of our Lord Jesus. Baptism to join in his suffering and death (Romans 6:3,6) and communion to remember him and his sufferings (Luke 22:19).\n  </p>\n\n  <p>\n    God has done much to ensure we remember the accomplishments of his son. But take special attention to notice God has memorialized the sufferings of his son. Oh, his miracles are wonderful, his freedom is enrapturing, and his joy overcoming! But what fountainhead do these flow from? The sufferings of the lamb.\n  </p>\n\n  <p>\n    Where are miracles without his suffering? By his stripes we are healed. Where is freedom without a bleeding lamb? Behold the lamb of God who takes away the sin of the world. Where is joy without atonement? We rejoice in God through our Lord Jesus Christ.\n  </p>\n\n  <p>\n    As we can see, heaven places much emphasis on our suffering savior. Now what are we to do with this? Well, Jesus commands us to pray on earth as it is in heaven. If heaven is honoring the sufferings of Christ above all, then, I believe, so should we. There are two ways we can do this in our own lives. First, by honoring his sufferings through remembrance and gratitude. Second, by clinging to our savior when we&nbsp;ourselves suffer.\n  </p>\n<hr class=\"separator separator--long-line\" />\n\n    <h2 id=\"remembering-his-sufferings\">\n      Remembering his sufferings\n    </h2>\n\n  <p>\n    Starting off, simply put, Jesus commands us to remember his sufferings (Luke 22:19). We could stop there, but why does God command us to remember? I believe the answer is threefold: to cultivate gratitude, to bring us close to him and to conform us into his image.\n  </p>\n\n    <h3 id=\"gratitude\">\n      Gratitude\n    </h3>\n\n  <p>\n    We see in Romans 1:21 a lack of thanksgiving towards God leading to the darkening of man’s heart. In contrast, contemplating the sufferings of Christ brings thanksgiving and light to men. Meditating on his passion brings awe, wonder and thanksgiving. Take this simple example:\n  </p>\n\n  <p>\n    <i>Jesus Christ - God himself - descended to earth, was rejected by his own creation and - willingly - suffered at their hands a gruesome death. This Jesus, the God-Man, came to die for his creation that wanted nothing to do with him. He came to die for me…me! Jesus came to bring me out of my Egypt, out of my darkness, out of my sin. Thank you Jesus!!</i>\n  </p>\n\n  <p>\n    Do you see how remembering his sufferings can easily and quickly birth thanksgiving in the heart? As this thanksgiving is birthed and takes hold, another scriptural truth is unveiled.\n  </p>\n\n    <h3 id=\"nearness\">\n      Nearness\n    </h3>\n\n  <p>\n    Let’s look at Psalm 100:4.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Enter into His gates with thanksgiving, and into His courts with praise.</i>\n  </p>\n\n  <p>\n    Remembering the sufferings of Christ invokes thanksgiving in the heart. Thanksgiving then opens the door into his very presence. Hallelujah! This has been God’s plan all along — to be with his people (see Genesis 17:7, Exodus 6:7, Jeremiah 32:38, 2 Corinthians 6:6, Hebrews 8:10, Revelation 21:3).\n  </p>\n\n  <p>\n    God desires to be close to us. This much is clear all throughout scripture. God walked with Adam and Eve in the garden of Eden. He physically visited Abraham. He led Israel as a pillar of fire. Jesus became flesh, walked the earth and communed with his creation. Now, the Holy Spirit has been given as a friend and a guide. Finally, this will all culminate in an everlasting marriage to the Lamb.\n  </p>\n\n  <p>\n    But why does God desire to be with us?\n  </p>\n\n  <p>\n    First, he loves us. God loves his creation and people like to be around those they love. God is no different. And what does John 3:16 say? For God so loved the world, he gave his only begotten son. Because God loves us, he gave himself to be with us.\n  </p>\n\n  <p>\n    Second, because he wants us to be like him.\n  </p>\n\n    <h3 id=\"conformityandnbsp\">\n      Conformity&nbsp;\n    </h3>\n\n  <p>\n    God has one ultimate goal for us: to look, act, walk, talk and behave like Jesus. As God sought a suitable helper for Adam, he is now seeking one for his son.&nbsp;\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For whom He foreknew, He also predestined to be conformed to the image of His Son, that he might be the firstborn among many brethren.</i><br>Romans 8:29\n  </p>\n\n  <p>\n    There’s not much more to say. God wants us to conform to the image of his son. He wants us back to our original design, created in his image (Genesis 1:26). But how can this happen? How can man look and behave like God? By spending time with God.\n  </p>\n\n  <p>\n    In the natural world, it matters who you spend time with. Those around you have great influence on the way you think, act and behave. It is the same with God. The more time we spend with God — in his presence — the greater the conformity. Not by our strength or will power, but by his Spirit and his grace. Paul puts it this way:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For I will not dare to speak of any of those things which Christ has not accomplished through me, in word and deed, to make the Gentiles obedient— in mighty signs and wonders, by the power of the Spirit of God<br></i>Romans 15:18-19&nbsp;<br>\n  </p>\n\n  <p>\n    Let’s be candid. It is impossible to be like Jesus — in our own strength. <i>But, with God, nothing is impossible</i>. This is where the next step in the process takes hold. It starts with thanksgiving. Thanksgiving brings us into God’s presence. Now, in his presence we begin to behold Him. This is the place of transformation.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Now the Lord is the Spirit; and where the Spirit of the Lord is, there is liberty. But we all, with unveiled face, beholding as in a mirror the glory of the Lord, are being transformed into the same image from glory to glory, just as by the Spirit of the Lord.</i><br>2 Corinthians 3:17-18<br>\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Not by might nor by power, but by my Spirit,’ says the LORD of hosts.</i><br>Zechariah 4:6<br>\n  </p>\n\n  <p>\n    It is by His Spirit that we are transformed. We can’t do it on our own. That’s why they’re called the fruits <i>of the Spirit</i> and the gifts <i>of the Spirit</i>. It is by the Spirit! As we spend time with God, the Holy Spirit works in us to conform us into the image of His Son. Hallelujah!\n  </p>\n\n    <h3 id=\"practical-steps\">\n      Practical steps\n    </h3>\n\n  <p>\n    Jesus was not flippant when he commanded do this in remembrance of me. He knew the power held within this simple act. This is the key to the Christian life. We are saved through grace by faith — but faith in what? Faith in what God accomplished through Jesus. Faith in the power of the cross. Faith in God’s love displayed for us. <b>Faith in the sufferings of Christ</b>.&nbsp;\n  </p>\n\n  <p>\n    So, how can we remember? Let’s take the Lord’s lead and do this in remembrance of him. What is this? Holy communion, receiving and remembering the body and blood of Jesus.&nbsp;\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Whoever eats my flesh and drinks my blood has eternal life</i><br>John 6:54<br>\n  </p>\n\n  <p>\n    Begin to take communion on your own, frequently, not just when your church happens to. A good practice alongside communion is meditating on relevant scriptures. One I’ve used is Mark 14:22:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>And as they were eating, Jesus took bread, blessed and broke it, and gave it to them and said, “Take eat, this is My body.”</i>\n  </p>\n\n  <p>\n    This is essentially the gospel summed up in one verse and a great jumping point to meditate on the person and actions of our Lord Jesus Christ. Allow the Holy Spirit to lead, guide and transform you as you thank, meditate and behold Christ in the midst of communion.\n  </p>\n<hr class=\"separator separator--long-line\" />\n\n    <h2 id=\"strength-while-suffering\">\n      Strength while suffering\n    </h2>\n\n  <p>\n    You don’t have to live long or look far to realize we live in a desperately fallen world. The ramifications of sin and godlessness are plain and destructive. Sin certainly is not a “victimless crime.”\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Therefore, just as through one man sin entered the world, and death through sin, and thus death spread to all men, because all sinned<br></i>Romans 5:12<br>\n  </p>\n\n  <p>\n    All of us have been stung by the pain of sin and the fallen human nature. We’ve made bad decisions that hurt ourselves and others. And we’ve been on the receiving end of those bad decisions, too.\n  </p>\n\n  <p>\n    But it is not just sin, there are also circumstances outside of our control. Life has a way of throwing curveballs. You lose a job. Freak weather wreaks havoc. Hospital bills stack up. These are things we face as we walk through life, to no fault of our own.\n  </p>\n\n  <p>\n    Then, lastly, there is the cross. As Christians, our Lord, Savior and God tells us:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>If anyone would come after me, let him deny himself and take up his cross daily and follow me. For whoever would save his life will lose it, but whoever loses his life for my sake will save it.</i><br>Luke 9:23-24&nbsp;<br>\n  </p>\n\n  <p>\n    The cross is part of the program. God has a special cross for each of his followers. And just like Jesus’ cross, it is a heavy, cumbersome and painful tool with one aim: obliterating sin.\n  </p>\n\n  <p>\n    As we can see, suffering is part of the human experience. Maybe even more so for the Christian. Jesus encapsulates our experience with suffering — and provides the solution — with this statement:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>In the world you will have tribulation. But take heart; I have overcome the world.<br></i>John 16:33<br>\n  </p>\n\n    <h3 id=\"you-will-have-tribulation\">\n      You will have tribulation\n    </h3>\n\n  <p>\n    As we can see trials will come, but how will we respond? Will we despair, play the victim, point our finger and look for the quickest way to safety? Or will we own the situation, lean into God and allow Him to lead and transform us through the process? These are the paths before us in each trial we face.\n  </p>\n\n  <p>\n    Revisiting Romans 8, we know that God’s ultimate goal is to conform us into the image of his Son. Facing suffering, difficulties and the weight of the cross can lead us to this desired Christlikeness. However, it is not a given that suffering equals Christlikeness, for our transformation depends largely on our response.\n  </p>\n\n  <p>\n    In the natural, we want to walk down Easy Street. We don’t want or welcome difficulties. We choose the path of least resistance. This is just the problem, there is no resistance on Easy Street. Easy Street doesn’t challenge you, doesn’t make you question, doesn’t require persistence, patience and perseverance, doesn’t require shifting your priorities, increasing your prayer time or setting aside the things you desire. Easy Street is easy.\n  </p>\n\n  <p>\n    God’s way is a little different. Take a look at these three verses.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Strengthening the souls of the disciples, exhorting them to continue in the faith, and saying, “We must through many tribulations enter the kingdom of God.<br></i>Acts 14:22<br>\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>And not only that, but we also glory in tribulations, knowing that tribulation produces perseverance; and perseverance character; and character, hope.</i><br>Romans 5:3-4<br>\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Though he was a Son, yet He learned obedience by the things which He suffered.</i><br>Hebrews 5:8&nbsp;<br>\n  </p>\n\n  <p>\n    There is purpose in suffering. God uses difficulty to prune, cleanse, purify and refine His people. He uses suffering to make them more like His Son. Trials present the opportunity to exercise our faith, to die to ourself, to learn patience, and, put simply, to place our trust in God alone. This is what God is looking for. This is the model Jesus displayed during His life on earth. Total dependence, total surrender, total trust in God.\n  </p>\n\n  <p>\n    But in these trials we are not alone. His name is Immanuel, God with us (Matthew 1:23) and has promised to never leave or forsake us (Matthew 28:20, Hebrews 13:5). He is a very present help in trouble (Psalm 46:1). So we are not alone, God is waiting eagerly, expectantly for us to turn to Him.\n  </p>\n\n  <p>\n    This is really the crux of the matter, turning to God. We can “grin and bear” our way through it, but that is not where the transformation comes. How would that make us any different than how the world deals with their problems? In trials we must turn to God in order to receive the full measure of blessing God intends.\n  </p>\n\n  <p>\n    But what is this blessing God intends? Typically we think of blessing as a new house, a new car, a new job or a check in the mail. While these are certainly blessings, God’s definition of blessing is much deeper. Look at Acts 3:26, Peter preaching the gospel to a group of Israelites.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>To you first, God, having raised up His Servant Jesus, sent Him to bless you, in turning away every one of you from your iniquities.<br></i>Acts 3:26&nbsp;<br>\n  </p>\n\n  <p>\n    You see, God’s blessings go far beyond physical needs and wants. God’s blessings reach the core of man. This is the essence of Christlikeness. The essence of what God wants for us. God wants to help us rid us of ourselves, of our sinful and fleshly nature, and restore us to our original design. Fully dependent upon Him, the loving Creator, and unmarred from the pain of sin, flesh and this fallen world. That is true blessing.\n  </p>\n\n    <h2 id=\"take-heartandnbsp\">\n      Take heart&nbsp;\n    </h2>\n\n  <p>\n    So how do we deal with all of this? How do we endure these tribulations? Let’s take one more look at Jesus’ statement.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>In the world you will have tribulation. But take heart; I have overcome the world.<br></i>John 16:33<br>\n  </p>\n\n  <p>\n    <i>In this world you will have tribulation</i> — we’ve already covered that. What is the antidote? To take heart, because Jesus has overcome the world! God is the answer. The real question to you: is he <i>your</i> answer? Who or what do you turn to in times of trouble? How do you <i>take heart</i>?&nbsp;\n  </p>\n\n  <p>\n    When faced with pain, the fallen human nature has two general responses. One tackles the problem head on, with no help from God, resolved to fix the issue with brute force and sheer will. The problem here is man becomes more and more reliant on self. More trusting in his or her own abilities to face challenges. But how long can that last? What stronghold of pride will that build in the heart?\n  </p>\n\n  <p>\n    The other tries as hard as it can to avoid, distract or somehow forget the pain is there. Here the avoidance of pain begets another set of issues. Drugs, alcohol, medication, pornography, work, TV, etc. These all disconnect us from reality and steal from our life. They may feel good in the moment, but that momentary pleasure is actually eternal bondage.\n  </p>\n\n  <p>\n    You see, our choices to face suffering in our own strength are few and flawed. What we really need during trials can only come from heaven. True strength, comfort, courage and peace. Not of our own accord, but drawn from a personal relationship with God, who is all of these things (see Psalm 46:1, 2 Corinthians 1:3, 2 Timothy 1:7, 2 Thessalonians 3:16).\n  </p>\n\n  <p>\n    There are two men in the Bible (among many others) who learned how to take heart in God in the face of suffering: David and Paul. These two men believed who God said he was, took him at his word and trusted him to the very core. Both faced tremendous difficulties in life, but more than that, tremendous victories in the Lord their God. Let’s learn from their experiences.\n  </p>\n\n    <h3 id=\"davidandnbsp\">\n      David&nbsp;\n    </h3>\n\n  <p class=\"msg msg--highlight\">\n    <i>“Now when David and his men came to Ziklag on the third day, the Amalekites had made a raid against the Negeb and against Ziklag. They had overcome Ziklag and burned it with fire and taken captive the women and all who were in it, both small and great. They killed no one, but carried them off and went their way. And when David and his men came to the city, they found it burned with fire, and their wives and sons and daughters taken captive. Then David and the people who were with him raised their voices and wept until they had no more strength to weep. David’s two wives also had been taken captive, Ahinoam of Jezreel and Abigail the widow of Nabal of Carmel. And David was greatly distressed, for the people spoke of stoning him, because all the people were bitter in soul, each for his sons and daughters. But David strengthened himself in the Lord his God.”</i><br>1 Samuel‬ ‭30‬:‭1‬-‭6‬<br>\n  </p>\n\n  <p>\n    This was quite the difficulty David was facing. His stronghold burned. His family and the families of his men taken. His life in jeopardy. What was David’s response? Immediately problem solve and go into “solution mode”? No. Did he whine, complain and despair? Woe is me! No. David strengthened himself in the Lord.\n  </p>\n\n  <p>\n    In the face of incredible difficulty, David turned to God. There is no earthly solution to a problem like this. What is a man, a leader to do? We have the option of trying to figure it out on our own or to shy away, but those don’t bring breakthrough. But God has the solution, God has the breakthrough. David knew this and knew he couldn’t solve or survive in his own strength. He turned to God for strength and God gave him the breakthrough, gave him the victory. Glory to God!\n  </p>\n\n    <h3 id=\"paul\">\n      Paul\n    </h3>\n\n  <p>\n    &nbsp;Paul was a man accustomed to trials, just read 2 Corinthians 11. But Paul wasn’t defined by his trials. He was defined by his God. This is why he could pen this in Romans:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Yet in all these things we are more than conquerors through Him who loved us.<br></i>Romans 8:37<br>\n  </p>\n\n  <p>\n    Or what about this:\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>And not on that, but we also <b>glory in tribulation</b>, knowing that tribulation produces perseverance</i><br>Romans 5:3<br>\n  </p>\n\n  <p>\n    Wow! How could a man who faced so much suffering write things like this?\n  </p>\n\n  <p>\n    There are a few answers to this question, but the one I want to emphasize is found in Romans 15:4.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>For whatever was written in former days was written for our instruction, that through endurance and <b>through the encouragement of the Scriptures</b> we might have hope.</i>\n  </p>\n\n  <p>\n    Paul was a man of the scriptures. All through Acts you see stories of Paul’s relationship with the scriptures: proving Jesus as Christ, preaching until midnight and preaching for hours each day for months on end. Why was Paul so enraptured by the scriptures? Because in them he found Jesus. Because in them he found encouragement. Because in them he found life.\n  </p>\n\n  <p>\n    Paul didn’t give the scriptures a passing glance. The scriptures were the bedrock of his faith. The source of his life. His ability to take another step in the midst of trial, tribulation and certain death. The scriptures weren’t some dead, boring text to Paul. Or something he had to cross off his “how to be a good Christian” list each day. Paul actually believed what Jesus said about the scriptures, “these are they which testify of me.” Paul found the living, breathing Christ in the scriptures.\n  </p>\n\n  <p>\n    The bible isn’t a dead manuscript full of rules and regulations. It is an invitation to the person of Christ. They are an unveiling of who he is, his character, his nature and his ways. The word continually becoming flesh, inviting us into a relationship with the person of Christ. Bible studies and devotionals are nice, but they can’t save, they can’t provide encouragement, they can’t provide life. Only Christ offers those things and he is waiting to be found by you in his word. Paul discovered this and you can too.\n  </p>\n\n    <h3 id=\"jesusandnbsp\">\n      Jesus&nbsp;\n    </h3>\n\n  <p>\n    When you find Jesus, you find life. When you find Jesus, you find the answer to every question. When you find Jesus, you find someone who knows you, who has experienced the very same thing you are experiencing and can offer comfort in our time of need.\n  </p>\n\n  <p class=\"msg msg--highlight\">\n    <i>Seeing then that we have a great high priest  who has passed through the heavens, Jesus the son of God, let us hold fast our confession. For we do not have a high priest who cannot sympathize with out weaknesses, but was in all points tempted as we are, yet without sin. Let us therefore come boldly to the throne of grace, that we may obtain mercy and find grace to help in time of need.</i><br>Hebrews 4:14-16&nbsp;<br>\n  </p>\n\n  <p>\n    That is my last and greatest admonition to you. Come to Jesus. Find him and you will find comfort, grace, mercy and help in your time of need. And always.&nbsp;\n  </p>",
            "author": {
                "name": "David Eads"
            },
            "tags": [
            ],
            "date_published": "2025-01-17T14:00:02-05:00",
            "date_modified": "2025-01-18T09:36:38-05:00"
        }
    ]
}
